{
  "Work Experience": [
    {
      "text": "Built and managed forecasting pipelines aligned with the full machine learning lifecycle, emphasizing reproducibility and documentation.",
      "description": {
        "company": "National University Health System",
        "role": "Data Scientist",
        "dates": "Dec 2024 - Present"
      }
    },
    {
      "text": "Developed scalable, housing-constrained cohort-component and logarithmic models to forecast Singapore’s resident and non-resident populations, using SingStat datasets and exogenous features forecasted with statsforecast to support long-term healthcare demand within NUHS cluster.",
      "description": {
        "company": "National University Health System",
        "role": "Data Scientist",
        "dates": "Dec 2024 - Present"
      }
    },
    {
      "text": "Managed and optimized a GAM-based bed occupancy forecasting pipeline, improving computational efficiency, forecast granularity, and internal documentation to support hospital resource planning, budgeting, and patient care decisions.",
      "description": {
        "company": "National University Health System",
        "role": "Data Scientist",
        "dates": "Dec 2024 - Present"
      }
    },
    {
      "text": "Developed and deployed a rule-based classification pipeline using tsfeatures to classify time series forecasts by materiality, volatility, and accuracy into intuitive labels, improving stakeholder interpretability.",
      "description": {
        "company": "Johnson & Johnson Pte Ltd",
        "role": "Data Science Intern",
        "dates": "May 2024 – Aug 2024"
      }
    },
    {
      "text": "Incorporated machine learning models using mlforecast, improving forecasting accuracy by ~70% for targeted time series previously forecasted with statistical and econometric models.",
      "description": {
        "company": "Johnson & Johnson Pte Ltd",
        "role": "Data Science Intern",
        "dates": "May 2024 – Aug 2024"
      }
    },
    {
      "text": "Designed and deployed a Dockerized Flask web application with Zoho REST APIs and SQLite backend, delivering a real-time KPI monitoring dashboard, reducing data-gathering for HR and management from one week to an hourly update.",
      "description": {
        "company": "MDesign Solutions Pte Ltd",
        "role": "Data Engineering Intern",
        "dates": "Aug 2023 – Jan 2024"
      }
    },
    {
      "text": "Utilized Git for version control to ensure proper documentation and smoother handovers.",
      "description": {
        "company": "MDesign Solutions Pte Ltd",
        "role": "Data Engineering Intern",
        "dates": "Aug 2023 – Jan 2024"
      }
    }
  ],

  "Education": [
    {
      "title": "Master of Science in Business Analytics",
      "text": "Cumulative Average Point: 4.64 / 5.00. Participated in NUS-NCS Innovation Challenge (Champion Group), WorldQuant Alphathon 2023, Philip Nova Trading Challenge 2023, Hack & Roll 2024, Hack4Good 2024.",
      "description": {
        "university": "National University of Singapore",
        "dates": "Aug 2023 – Sep 2024",
        "degree": "MSc Business Analytics"
      }
    },
    {
      "title": "Bachelor of Engineering (Honours) in Biomedical Engineering",
      "text": "Cumulative Average Point: 4.39 / 5.00. Final Thesis: Developed a lightweight wheeled robot utilizing MediaPipe 3D pose estimation and polynomial fitting for gait analysis, improving prehabilitation efficiency and reducing reliance on specialized equipment and personnel.",
      "description": {
        "university": "National University of Singapore",
        "dates": "Aug 2020 – Jul 2023",
        "degree": "BEng (Hons) Biomedical Engineering"
      }
    },
    {
      "title": "Undergraduate Research Opportunities Programme",
      "text": "Developed a soft, tactile wearable gaming input device with capacitive sensors and low-latency response, enhancing immersive gaming experiences through improved tactile interaction.",
      "description": {
        "university": "National University of Singapore",
        "dates": "2022",
        "degree": "UROP Project"
      }
    }
  ],

  "Skills": [
    {
      "text": "Programming & Tools: Python, SQL, JavaScript, C, Git, Docker. Analytical & ML Tools: Tableau, pandas, NumPy, SQL, tsfeatures, scikit-learn, statsforecast, mlforecast, PyTorch Lightning. Web Technologies: Flask, Django, ReactJS, Node.js.",
      "description": {}
    },
    {
      "text": "Soft Skills: Analytical thinking, problem-solving, time management, adaptability, project management, effective communication, teamwork. Certifications: AWS SageMaker Practical (Udemy), DeepLearning.AI Machine Learning in Production, IBM Data Science Professional Certificate.",
      "description": {}
    }
  ],

  "Projects": [
    {
      "text": "Created educational materials for 65drones on phishing email detection using Word2Vec and spaCy embeddings, along with Isolation Forest and custom PyTorch Lightning autoencoders.",
      "description": {}
    },
    {
      "text": "Implemented a CNN image segmentation model for multi-label movie genre classification, fine-tuned with a pre-trained ResNet18 feature extractor.",
      "description": {}
    },
    {
      "text": "Implemented a DistilBERT-based newsgroup classifier with custom preprocessing and tokenization, fine-tuned frozen layers, and tracked training metrics using TensorBoard.",
      "description": {}
    }
  ]
}
